tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
struct LatestRecordContext {
    bool found = false;
    StoredWateringRecord record{};
};

void collectLatestRecord(const StoredWateringRecord& record, void* user) {
    auto* context = static_cast<LatestRecordContext*>(user);
    if (context && !context->found) {
        context->record = record;
        context->found = true;
    }
}

struct RecordRowsContext {
    const IrrigationConfig* config;
    uint32_t emitted;
};

void sendRecordDetailDialog(const StoredWateringRecord& record,
                            const IrrigationConfig* config,
                            const char* dialogPrefix) {
    const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(record.payload);
    Esp32BaseWeb::sendChunk("<dialog id='");
    Esp32BaseWeb::sendChunk(dialogPrefix);
    sendUnsigned(record.recordId);
    Esp32BaseWeb::sendChunk("' class='panel eb-modal record-detail-dialog' data-eb-light-dismiss='1'><div class='record-detail-head'><div><span class='muted'>浇水记录</span><h2>#");
    sendUnsigned(record.recordId);
    Esp32BaseWeb::sendChunk("</h2></div><button type='button' class='secondary record-detail-close' onclick='this.closest(\"dialog\").close()'>关闭</button></div><div class='record-detail-grid'><div><b>完成时间</b><span>");
    sendRecordTime(record.timing);
    Esp32BaseWeb::sendChunk("</span></div><div><b>来源</b><span>");
    sendRecordSource(record.payload, config);
    Esp32BaseWeb::sendChunk("</span></div><div><b>结果</b><span class='tag ");
    Esp32BaseWeb::sendChunk(resultToneClass(record.payload.result));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(resultName(record.payload.result));
    Esp32BaseWeb::sendChunk("</span></div><div><b>结束原因</b><span>");
    Esp32BaseWeb::sendChunk(stopReasonName(record.payload.stopReason));
    Esp32BaseWeb::sendChunk("</span></div><div><b>计划浇水时间</b><span>");
    sendDuration(totals.plannedDurationSec);
    Esp32BaseWeb::sendChunk("</span></div><div><b>实际浇水时间</b><span>");
    sendDuration(totals.actualWateringSec);
    Esp32BaseWeb::sendChunk("</span></div><div><b>整次历时</b><span>");
    sendDuration(record.timing.durationSec);
    Esp32BaseWeb::sendChunk("</span></div><div><b>总脉冲</b><span>");
    sendUnsigned64(totals.pulseCount);
    Esp32BaseWeb::sendChunk("</span></div><div><b>历史估算总水量</b><span>");
    if (recordHasCappedEstimate(record.payload)) {
        Esp32BaseWeb::sendChunk("至少 ");
    }
    sendWaterVolume(totals.estimatedWaterMl);
    Esp32BaseWeb::sendChunk("</span></div></div><div class='record-detail-section'><h3>水路明细</h3><p>名称按当前水路设置显示，历史时长、脉冲和水量保持记录当时的值。</p><div class='tablewrap'><table class='record-zone-table'><thead><tr><th>水路</th><th>结果</th><th>计划时间</th><th>实际时间</th><th>脉冲</th><th>历史估算水量</th><th>异常标记</th></tr></thead><tbody>");
    for (uint8_t index = 0; index < record.payload.zones.size(); ++index) {
        const ZoneWateringRecord& zone = record.payload.zones[index];
        if (zone.plannedDurationSec == 0) continue;
        Esp32BaseWeb::sendChunk("<tr><td data-label='水路'><b>");
        if (config) {
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(index + 1U);
        }
        Esp32BaseWeb::sendChunk("</b><small>#");
        sendUnsigned(index + 1U);
        Esp32BaseWeb::sendChunk("</small></td><td data-label='结果'>");
        Esp32BaseWeb::sendChunk(zoneResultName(zone.result));
        Esp32BaseWeb::sendChunk("</td><td data-label='计划时间'>");
        sendDuration(zone.plannedDurationSec);
        Esp32BaseWeb::sendChunk("</td><td data-label='实际时间'>");
        sendDuration(zone.actualWateringSec);
        Esp32BaseWeb::sendChunk("</td><td data-label='脉冲'>");
        sendUnsigned(zone.pulseCount);
        Esp32BaseWeb::sendChunk("</td><td data-label='历史估算水量'>");
        if ((zone.flags & WateringRecordCodec::kZoneFlagWaterEstimateCapped) != 0) {
            Esp32BaseWeb::sendChunk("至少 ");
        }
        sendWaterVolume(zone.estimatedWaterMl);
        Esp32BaseWeb::sendChunk("</td><td data-label='异常标记'><div class='record-flags'>");
        if (zone.flags == 0) {
            Esp32BaseWeb::sendChunk("<span class='muted'>无</span>");
        } else {
            if ((zone.flags & WateringRecordCodec::kZoneFlagLowFlow) != 0) {
                Esp32BaseWeb::sendChunk("<span class='tag warn'>低流量</span>");
            }
            if ((zone.flags & WateringRecordCodec::kZoneFlagHighFlow) != 0) {
                Esp32BaseWeb::sendChunk("<span class='tag danger'>高流量</span>");
            }
            if ((zone.flags & WateringRecordCodec::kZoneFlagWaterEstimateCapped) != 0) {
                Esp32BaseWeb::sendChunk("<span class='tag warn'>水量达到记录上限</span>");
            }
        }
        Esp32BaseWeb::sendChunk("</div></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div></div><div class='actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>关闭</button></div></dialog>");
}

void sendRecordRow(const StoredWateringRecord& record, void* user) {
    RecordRowsContext* context = static_cast<RecordRowsContext*>(user);
    const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(record.payload);
    if (context) ++context->emitted;
    Esp32BaseWeb::sendChunk("<tr><td data-label='编号' class='record-id'>#");
    sendUnsigned(record.recordId);
    Esp32BaseWeb::sendChunk("</td><td data-label='完成时间' class='record-time'>");
    sendRecordTime(record.timing);
    Esp32BaseWeb::sendChunk("</td><td data-label='来源'>");
    sendRecordSource(record.payload, context ? context->config : nullptr);
    Esp32BaseWeb::sendChunk("</td><td data-label='结果'><span class='tag ");
    Esp32BaseWeb::sendChunk(resultToneClass(record.payload.result));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(resultName(record.payload.result));
    Esp32BaseWeb::sendChunk("</span></td><td data-label='实际浇水时间' class='record-number'>");
    sendDuration(totals.actualWateringSec);
    Esp32BaseWeb::sendChunk("</td><td data-label='历史估算水量' class='record-number'>");
    if (recordHasCappedEstimate(record.payload)) Esp32BaseWeb::sendChunk("至少 ");
    sendWaterVolume(totals.estimatedWaterMl);
    Esp32BaseWeb::sendChunk("</td><td data-label='操作' class='record-action'><button type='button' class='btnlink info compact' onclick=\"document.getElementById('record-detail-");
    sendUnsigned(record.recordId);
    Esp32BaseWeb::sendChunk("').showModal()\">查看详情</button>");
    sendRecordDetailDialog(record, context ? context->config : nullptr, "record-detail-");
    Esp32BaseWeb::sendChunk("</td></tr>");
}

void csvRecord(const StoredWateringRecord& record, void*) {
    const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(record.payload);
    char line[192];
    std::snprintf(line,
                  sizeof(line),
                  "%lu,%lu,%s,%u,%s,%lu,%llu,%llu\r\n",
                  static_cast<unsigned long>(record.recordId),
                  static_cast<unsigned long>(record.timing.completedEpochSec),
                  sourceName(record.payload.source),
                  record.payload.planId,
                  resultName(record.payload.result),
                  static_cast<unsigned long>(record.timing.durationSec),
                  static_cast<unsigned long long>(totals.pulseCount),
                  static_cast<unsigned long long>(totals.estimatedWaterMl));
    Esp32BaseWeb::sendChunk(line);
}

struct EventFilter {
    uint8_t level = 0;
    int8_t category = -1;
    char query[64]{};
};

struct EventRowsContext {
    const EventFilter* filter;
    uint32_t offset;
    uint32_t limit;
    uint32_t matched;
    uint32_t emitted;
};

const char* eventToneClass(Esp32BaseAppEvents::Level level) {
    switch (level) {
        case Esp32BaseAppEvents::Level::Warning: return "warn";
        case Esp32BaseAppEvents::Level::Error: return "danger";
        case Esp32BaseAppEvents::Level::Info:
        default: return "info";
    }
}

void sendEventTime(const Esp32BaseRecordStore::RecordTiming& timing) {
    uint32_t epoch = 0;
    char text[32]{};
    if (Esp32BaseRecordStore::resolveCompletedEpoch(timing, epoch) &&
        Esp32BaseTime::formatEpoch(epoch, text, sizeof(text), "%m-%d %H:%M:%S")) {
        Esp32BaseWeb::sendChunk(text);
        return;
    }
    Esp32BaseWeb::sendChunk("设备启动后 ");
    sendUnsigned(timing.completedUptimeSec);
    Esp32BaseWeb::sendChunk(" 秒");
}

bool eventMatches(const Esp32BaseAppEvents::EventRecord& event,
                  const EventFilter& filter) {
    if (filter.level != 0 && static_cast<uint8_t>(event.level) != filter.level) return false;
    return filter.category < 0 ||
           static_cast<uint8_t>(IrrigationEvents::category(event)) ==
               static_cast<uint8_t>(filter.category);
}

void sendEventDetailDialog(const Esp32BaseAppEvents::EventRecord& event,
                           const char* dialogId) {
    char title[96]{};
    char summary[160]{};
    IrrigationEvents::formatTitle(event, title, sizeof(title));
    IrrigationEvents::formatSummary(event, summary, sizeof(summary));
    Esp32BaseWeb::sendChunk("<dialog id='");
    Esp32BaseWeb::sendChunk(dialogId);
    Esp32BaseWeb::sendChunk("' class='panel eb-modal event-detail' data-eb-light-dismiss='1'><div class='event-detail-head'><div class='event-detail-heading'><span class='tag ");
    Esp32BaseWeb::sendChunk(eventToneClass(event.level));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(IrrigationEvents::levelName(event.level));
    Esp32BaseWeb::sendChunk("</span><h2>");
    Esp32BaseWeb::writeHtmlEscaped(title);
    Esp32BaseWeb::sendChunk("</h2></div><button type='button' class='secondary compact event-detail-close' onclick='this.closest(\"dialog\").close()'>关闭</button></div><p class='event-detail-summary'>");
    Esp32BaseWeb::writeHtmlEscaped(summary);
    Esp32BaseWeb::sendChunk("</p><section class='event-detail-section'><h3>事件概况</h3><div class='event-detail-grid event-detail-overview'><div><b>发生时间</b><span class='event-time-value'>");
    sendEventTime(event.timing);
    Esp32BaseWeb::sendChunk("</span></div><div><b>严重程度</b><span><span class='tag ");
    Esp32BaseWeb::sendChunk(eventToneClass(event.level));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(IrrigationEvents::levelName(event.level));
    Esp32BaseWeb::sendChunk("</span></span></div><div><b>业务分类</b><span>");
    Esp32BaseWeb::sendChunk(IrrigationEvents::categoryName(IrrigationEvents::category(event)));
    Esp32BaseWeb::sendChunk("</span></div></div></section>");
    const IrrigationEvents::EventCode eventCode =
        static_cast<IrrigationEvents::EventCode>(event.eventCode);
    if (eventCode == IrrigationEvents::EventCode::WateringStoppedAbnormally ||
        eventCode == IrrigationEvents::EventCode::FlowDeviation) {
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>相关数据</h3><div class='event-detail-grid event-detail-business'><div><b>水路</b><span>");
        sendUnsigned(event.objectId);
        Esp32BaseWeb::sendChunk("</span></div><div><b>检测脉冲</b><span>");
        sendUnsigned(event.value1 < 0 ? 0 : static_cast<uint32_t>(event.value1));
        Esp32BaseWeb::sendChunk(" 个</span></div><div><b>实际时间</b><span>");
        sendUnsigned(event.value2 < 0 ? 0 : static_cast<uint32_t>(event.value2));
        Esp32BaseWeb::sendChunk(" 秒</span></div></div></section>");
    } else if (eventCode == IrrigationEvents::EventCode::ClosedValveFlow) {
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>相关数据</h3><div class='event-detail-grid event-detail-business'><div><b>窗口脉冲</b><span>");
        sendUnsigned(event.value1 < 0 ? 0 : static_cast<uint32_t>(event.value1));
        Esp32BaseWeb::sendChunk(" 个</span></div><div><b>检测窗口</b><span>");
        sendUnsigned(event.value2 < 0 ? 0 : static_cast<uint32_t>(event.value2));
        Esp32BaseWeb::sendChunk(" 秒</span></div></div></section>");
    } else if (eventCode == IrrigationEvents::EventCode::FlowCalibrationSaved) {
        const uint32_t coefficient = event.value1 < 0 ? 0 : static_cast<uint32_t>(event.value1);
        char coefficientText[24]{};
        std::snprintf(coefficientText, sizeof(coefficientText), "%lu.%02lu P/L",
                      static_cast<unsigned long>(coefficient / 100U),
                      static_cast<unsigned long>(coefficient % 100U));
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>相关数据</h3><div class='event-detail-grid event-detail-business'><div><b>稳态流量系数</b><span>");
        Esp32BaseWeb::sendChunk(coefficientText);
        Esp32BaseWeb::sendChunk("</span></div></div></section>");
    } else if (eventCode == IrrigationEvents::EventCode::ZoneFlowSaved) {
        char flow[20]{};
        IrrigationConfigRules::formatLitersPerMinute(
            event.value1 < 0 ? 0 : static_cast<uint32_t>(event.value1), flow, sizeof(flow));
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>相关数据</h3><div class='event-detail-grid event-detail-business'><div><b>水路</b><span>");
        sendUnsigned(event.objectId);
        Esp32BaseWeb::sendChunk("</span></div><div><b>基准流量</b><span>");
        if (event.value1 == 0) {
            Esp32BaseWeb::sendChunk("已清除");
        } else {
            Esp32BaseWeb::sendChunk(flow);
            Esp32BaseWeb::sendChunk(" L/min");
        }
        Esp32BaseWeb::sendChunk("</span></div></div></section>");
    } else if (eventCode == IrrigationEvents::EventCode::AutomaticPlanSkipped) {
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>相关对象</h3><div class='event-detail-grid event-detail-business'><div><b>计划</b><span>");
        sendUnsigned(event.objectId);
        Esp32BaseWeb::sendChunk("</span></div></div></section>");
    } else if (eventCode == IrrigationEvents::EventCode::ConfigurationChanged &&
               event.objectId != 0) {
        const IrrigationEvents::ReasonCode reason =
            static_cast<IrrigationEvents::ReasonCode>(event.reasonCode);
        const bool zoneChanged = reason == IrrigationEvents::ReasonCode::ZoneUpdated;
        Esp32BaseWeb::sendChunk("<section class='event-detail-section'><h3>相关对象</h3><div class='event-detail-grid event-detail-business'><div><b>");
        Esp32BaseWeb::sendChunk(zoneChanged ? "水路" : "计划");
        Esp32BaseWeb::sendChunk("</b><span>");
        sendUnsigned(event.objectId);
        Esp32BaseWeb::sendChunk("</span></div></div></section>");
    }
    Esp32BaseWeb::sendChunk("<details class='event-technical'><summary>技术信息</summary><div class='event-detail-grid event-detail-technical-grid'><div><b>记录编号</b><span>#");
    sendUnsigned(event.recordId);
    Esp32BaseWeb::sendChunk("</span></div><div><b>事件码</b><span>");
    sendUnsigned(event.eventCode);
    Esp32BaseWeb::sendChunk("</span></div><div><b>原因码</b><span>");
    sendUnsigned(event.reasonCode);
    Esp32BaseWeb::sendChunk("</span></div><div><b>对象 ID</b><span>");
    sendUnsigned(event.objectId);
    Esp32BaseWeb::sendChunk("</span></div><div><b>数值 1</b><span>");
    char signedValue[20];
    std::snprintf(signedValue, sizeof(signedValue), "%ld", static_cast<long>(event.value1));
    Esp32BaseWeb::sendChunk(signedValue);
    Esp32BaseWeb::sendChunk("</span></div><div><b>数值 2</b><span>");
    std::snprintf(signedValue, sizeof(signedValue), "%ld", static_cast<long>(event.value2));
    Esp32BaseWeb::sendChunk(signedValue);
    Esp32BaseWeb::sendChunk("</span></div><div><b>标记</b><span>");
    sendUnsigned(event.flags);
    Esp32BaseWeb::sendChunk("</span></div><div><b>条件 ID</b><span>");
    sendUnsigned(event.conditionId);
    Esp32BaseWeb::sendChunk("</span></div><div><b>事件类型</b><span>");
    sendUnsigned(static_cast<uint32_t>(event.eventKind));
    Esp32BaseWeb::sendChunk("</span></div><div><b>启动编号</b><span>");
    sendUnsigned(event.timing.completedBootId);
    Esp32BaseWeb::sendChunk("</span></div><div><b>启动后时间</b><span>");
    sendUnsigned(event.timing.completedUptimeSec);
    Esp32BaseWeb::sendChunk(" 秒</span></div><div><b>持续时间</b><span>");
    sendUnsigned(event.timing.durationSec);
    Esp32BaseWeb::sendChunk(" 秒</span></div></div></details></dialog>");
}

void sendEventRow(const Esp32BaseAppEvents::EventRecord& event, void* user) {
    EventRowsContext* context = static_cast<EventRowsContext*>(user);
    if (!context || !context->filter || !eventMatches(event, *context->filter)) return;
    const uint32_t index = context->matched++;
    if (index < context->offset || context->emitted >= context->limit) return;
    ++context->emitted;
    char title[96]{};
    char summary[160]{};
    char dialogId[28]{};
    IrrigationEvents::formatTitle(event, title, sizeof(title));
    IrrigationEvents::formatSummary(event, summary, sizeof(summary));
    std::snprintf(dialogId, sizeof(dialogId), "event-detail-%lu",
                  static_cast<unsigned long>(event.recordId));
    Esp32BaseWeb::sendChunk("<tr><td data-label='时间' class='event-time'>");
    sendEventTime(event.timing);
    Esp32BaseWeb::sendChunk("</td><td data-label='等级' class='event-level'><span class='tag ");
    Esp32BaseWeb::sendChunk(eventToneClass(event.level));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(IrrigationEvents::levelName(event.level));
    Esp32BaseWeb::sendChunk("</span></td><td data-label='分类' class='event-category'>");
    Esp32BaseWeb::sendChunk(IrrigationEvents::categoryName(IrrigationEvents::category(event)));
    Esp32BaseWeb::sendChunk("</td><td data-label='事件' class='event-title'>");
    Esp32BaseWeb::writeHtmlEscaped(title);
    Esp32BaseWeb::sendChunk("</td><td data-label='说明' class='event-summary'>");
    Esp32BaseWeb::writeHtmlEscaped(summary);
    Esp32BaseWeb::sendChunk("</td><td data-label='操作' class='event-action'><button type='button' class='btnlink info compact' onclick=\"document.getElementById('");
    Esp32BaseWeb::sendChunk(dialogId);
    Esp32BaseWeb::sendChunk("').showModal()\">查看详情</button>");
    sendEventDetailDialog(event, dialogId);
    Esp32BaseWeb::sendChunk("</td></tr>");
}

}  // namespace

bool IrrigationWeb::registerRoutes(IrrigationApp& app) {
    g_app = &app;
    Esp32BaseWeb::setDeviceName("智能浇水");
    Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_APP);
    Esp32BaseWeb::setHomePath("/irrigation");
    return Esp32BaseWeb::addPage("/irrigation", "首页", overview) &&
           Esp32BaseWeb::addPage("/irrigation/plans", "计划", plans) &&
           Esp32BaseWeb::addPage("/irrigation/zones", "水路", zones) &&
           Esp32BaseWeb::addPage("/irrigation/records", "记录", records) &&
           Esp32BaseWeb::addPage("/irrigation/events", "事件", events) &&
           Esp32BaseWeb::addPage("/irrigation/settings", "设置", settings) &&
           Esp32BaseWeb::addRoute("/irrigation", Esp32BaseWeb::METHOD_POST, overview) &&
           Esp32BaseWeb::addRoute("/irrigation/plans", Esp32BaseWeb::METHOD_POST, plans) &&
           Esp32BaseWeb::addRoute("/irrigation/zones", Esp32BaseWeb::METHOD_POST, zones) &&
           Esp32BaseWeb::addRoute("/irrigation/zones/flow-calibration",
                                  Esp32BaseWeb::METHOD_GET,
                                  flowCalibration) &&
           Esp32BaseWeb::addRoute("/irrigation/zones/flow-calibration",
                                  Esp32BaseWeb::METHOD_POST,
                                  flowCalibration) &&
           Esp32BaseWeb::addRoute("/irrigation/zones/learning",
                                  Esp32BaseWeb::METHOD_GET,
                                  zoneLearning) &&
           Esp32BaseWeb::addRoute("/irrigation/zones/learning",
                                  Esp32BaseWeb::METHOD_POST,
                                  zoneLearning) &&
           Esp32BaseWeb::addApi("/irrigation/api/status", statusApi) &&
           Esp32BaseWeb::addApi("/irrigation/api/flow-history", flowHistoryApi) &&
           Esp32BaseWeb::addRoute("/irrigation/records.csv",
                                  Esp32BaseWeb::METHOD_GET,
                                  recordsCsv);
}

